[
    "Our client, a global leader in high quality, end-to-end signal transmission solutions, delivers a comprehensive product portfolio designed to meet the mission-critical network infrastructure needs of industrial, enterprise and broadcast markets. With innovative solutions targeted at reliable and secure transmission of rapidly growing amounts of data, audio and video needed for today's applications, our client is at the center of the global transformation to a connected world. Join our team to build the next generation of the client's Industrial Networking Solutions helping the clients to create an industrial infrastructure that supports achieving their industrial edge and IIoT goals.\nCI framework development\nLiaise with internal teams (e.g. developers and architects) to identify system requirements\nReview requirements, specifications and technical design documents to provide timely and meaningful feedback\nEstimate, prioritize, plan and execute activities\nCreate detailed, comprehensive and well-structured development roadmap\nImprove and develop functionality for internal test automation framework\nDesign, develop and execute automated tests\nPerform regression testing for framework validation and investigate results by debugging failed tests\nIdentify, record, document thoroughly and track issues\nDebug issues and help the fixing process\nPerform necessary testing when issues are resolved\nStay up-to-date with new testing tools and technologies\nAdvanced Python Development, Django/Flask Web frameworks, development under Linux\nGit, Agile Software Development, CI flows and tools",
    "\tDevelop and implement synthetic integration tests that simulate real-world user interactions across our platform.\n\tAutomate end-to-end test scenarios for websites and APIs to detect failures early.\n\tIntegrate testing frameworks into CI/CD pipelines to enable continuous validation of system integrity.\n\tWork closely with Development and DevOps teams to enhance observability and improve incident detection.\n\tCollaborate with developers to ensure best practices for testability and maintainability in software design.\n\tContribute to monitoring and alerting strategies by ensuring that test failures provide meaningful insights.\n\tDegree in computer science or equivalent\n\tStrong experience with automated testing frameworks (e.g., Playwright, Cypress, Selenium, Pact, Karate, or similar).\n\tProficiency in scripting and programming (Python, JavaScript, TypeScript, or other relevant languages).\n\tHands-on experience with API and webpage testing\n\tFamiliarity with CI/CD pipelines and test automation in environments like GitHub Actions, Jenkins, or GitLab CI.\n\tExperience with observability and monitoring tool (e.g. Prometheus and Grafana)\n\tStrong communication skills and a collaborative mindset.\n\tGood written and spoken English communication skills\n\tValid EU work permit\n\tThe opportunity to work in a young and dynamic company with a \"startup feeling\" and to be part of an international corporation at the same time.\n\tA responsible and varied field of activity in an international multicultural team.\n\tVariety of employee benefits depending on location, such as healthy work-life balance, fresh fruits and drinks, ergonomic workplace, etc.\n\tModern and adapted agile methodology at all levels in a product-oriented environment.\n\tState of the art technology stack: Java & Spring Boot backend, Angular SPA with Typescript, Aurora MySQL database, Microservice architecture, AWS cloud, Docker Containers and Kubernetes & Istio, Modern CI/CD pipeline.\n",
    "Manage Cloud Environment and Resources: Assist in the provisioning, configuration, and management of cloud resources across various platforms (e.g., AWS, Azure, Google Cloud) to support application deployment and scaling.\nBuild Infrastructure as Code (IaC) Solutions: Help design, develop, and maintain Infrastructure as Code (IaC) solutions using tools such as Terraform, CloudFormation, or similar to automate the creation and management of cloud resources.\nCreate and Executing Pipelines and Workflows: Assist in the creation and optimization of CI/CD pipelines to automate deployment workflows, ensuring efficient and reliable application deployment and integration processes.\nOperational Tasks on Cloud Infrastructure: Monitor, troubleshoot, and support operational tasks such as resolving network issues, maintaining cloud servers, and ensuring system reliability and uptime.\nSupport Cloud Migrations: Assist in the planning, testing, and execution of cloud migration strategies, including moving applications, data, and workloads from on-premises environments to the cloud.\nPaid, several-month internship program - min. 3 months, 4-5 days a week, with flexible working hours and possibility to work remotely.\nA chance for long-term cooperation - there is a high probability that at the end of the internship, we will offer you a full-time job.\nAmbitious projects for the most prestigious clients in the world.\nThe opportunity to gain skills, knowledge and experience while working in international teams and with experts from the dynamically developing digital sector.\nCareer development - based on a culture of feedback and constant support from a mentor, a clear path of development from the first day of work and Buddy's help in a new workplace.\nProficiency in English and Polish (both written and oral), with strong communication skills.\nActive student status or technical degree, with availability to work a minimum of 24 hours per week (increasing to at least 32 hours after 3-6 months).\nExperience writing scripts in one of the following programming languages: Bash, Python, or JavaScript.\nPractical knowledge of using/administering Linux/Unix systems via the command line, with strong problem-solving abilities.\nA passion for cloud technologies and a strong motivation to grow your career in cloud engineering.\nKnowledge of version control systems like Git.\nFamiliarity with AWS, GCP, or Azure cloud platforms.\nUnderstanding of IP networks, VPNs, DNS, subnetting, routing tables, and firewalls.\nBasic knowledge of DevOps methodologies.",
    "Diseñar, desarrollar y mantener pipelines de datos para la adquisición, almacenamiento, procesamiento y análisis de datos.\nImplementar y mantener soluciones de almacenamiento y procesamiento de datos a gran escala, como bases de datos, almacenes de datos y sistemas de procesamiento distribuido.\nDiseñar e implementar soluciones de integración de datos y ETL (Extract, Transform, Load) para garantizar la calidad y consistencia de los datos.\nResponsabilizarse de la puesta en producción de los modelos generados por los equipos de Data Scientists.\nColaborar con los equipos de Data Science y otros equipos técnicos para entender los requisitos de datos y garantizar la entrega de datos confiables y de alta calidad.\nOptimizar el rendimiento y la escalabilidad de los sistemas de datos para garantizar un procesamiento eficiente y rápido de los datos.\nMonitorear y solucionar problemas de rendimiento, disponibilidad y confiabilidad de la infraestructura de datos.\nEstar estudiando un Grado/Máster/Phd STEM en algún centro con la posibilidad de convenio de prácticas.\nConocimiento del lenguaje de programación Python y SQL\nExperiencia en el desarrollo de ETLs y ELTs\nConocimiento de Git (Gitlab, github, gitflow)\nConocimiento de Cloud Computing (AWS, GCP, Azure) yComputación distribuida (Spark)\nNociones de Docker y Kubernetes\nExperiencia con Data architectures (Data lake/Lake house/Data factory)\nOrquestación de procesos (Airflow)\nBeca remunerada\nContrato a tiempo completo o parcial, según necesidad\nFlexibilidad horaria para compaginar con los estudios\nPosibilidad de incorporación tras el periodo de prácticas. En BEONx, nos gusta apostar por el talento interno, y la visión de estas prácticas es un punto de entrada para encontrar perfiles que se queden con nosotros\nTrabajo 100% Remoto desde España o región UE (tenemos oficinas en Madrid, Barcelona y Salamanca).\nLa oportunidad de ser parte del equipo durante nuestra expansión global y aprender de un equipo de primer nivel para el éxito del cliente.\nUn plan de carrera convincente que desbloqueará infinitas posibilidades e impulsará tu trayectoria profesional.\nUn ambiente familiar y unido, donde la comunicación abierta fluye libre y horizontalmente.",
    "Create, develop and optimize data interfaces with usage of ETL tools e.g. Talend, SAS DI, Mulesoft, Informatica\nWork with experienced developers to become an independent developer and work as a part of Scrum team responsible for development of data warehouses\nParticipate in whole product life cycle, starting with design, through development and testing, ending with delivering created solution\nCreate and maintain technical documentation\nPaid, several-month internship program - min. 3 months, 4-5 days a week, with flexible working hours and possibility to work remotely.\nA chance for long-term cooperation - there is a high probability that at the end of the internship, we will offer you a full-time job.\nAmbitious projects for the most prestigious clients in the world.\nThe opportunity to gain skills, knowledge and experience while working in international teams and with experts from the dynamically developing digital sector.\nCareer development - based on a culture of feedback and constant support from a mentor, a clear path of development from the first day of work and Buddy's help in a new workplace.\nBasic knowledge of SQL\nCommunicative English allowing to understand technical documentation\nKnowledge of designing data warehouses\nAvailability 32h/week (hybrid mode – at least 2 days in the office Łódź/Katowice)\nBasic knowledge of at least one programming language (e.g. Python, C++, C#, Java)",
    "Project Description:\nOur client, a global leader in high quality, end-to-end signal transmission solutions, delivers a comprehensive product portfolio designed to meet the mission-critical network infrastructure needs of industrial, enterprise and broadcast markets. With innovative solutions targeted at reliable and secure transmission of rapidly growing amounts of data, audio and video needed for today's applications, our client is at the center of the global transformation to a connected world. Join our team to build the next generation of the client's Industrial Networking Solutions helping the clients to create an industrial infrastructure that supports achieving their industrial edge and IIoT goals.\nResponsibilities:\n- CI framework development\n- Liaise with internal teams (e.g. developers and architects) to identify system requirements\n- Review requirements, specifications and technical design documents to provide timely and meaningful feedback\n- Estimate, prioritize, plan and execute activities\n- Create detailed, comprehensive and well-structured development roadmap\n- Improve and develop functionality for internal test automation framework\n- Design, develop and execute automated tests\n- Perform regression testing for framework validation and investigate results by debugging failed tests\n- Identify, record, document thoroughly and track issues\n- Debug issues and help the fixing process\n- Perform necessary testing when issues are resolved\n- Stay up-to-date with new testing tools and technologies\nMandatory Skills Description:\nAdvanced Python Development, Django/Flask Web frameworks, development under Linux",
    "Dyneema®, the world's strongest fiber™, enables unmatched levels of performance and protection for end-use applications, including ballistic personal protection, marine and sustainable infrastructure and outdoor sports\nUnique technologies that improve the recyclability of products and enable recycled content to be incorporated, thus advancing a more circular economy\nLight-weighting solutions that replace heavier traditional materials like metal, glass and wood, which can improve fuel efficiency in all modes of transportation and reduce carbon footprint\nSustainable infrastructure solutions that increase energy efficiency, renewable energy, natural resource conservation and fiber optic / 5G network accessibility\nActs as a contributing member of the team.\nContributes in various projects and initiatives.\nPresents key learning and results to the leadership team.\nOther projects and responsibilities as assigned.\nCurrently pursuing a Bachelor’s or Master’s Degree in Computer Engineering or Big Data Analytics (affiliated with University in France, UK, Belgium, Luxembourg, Spain, Sweden, or Poland.)\nPrior internship experience\nStrong interpersonal communication skills and ability to interact with individuals across the organization.\nAbility to work as part of a team with excellent collaboration skills across other functions and with business partners.\nAbility and discipline to work remotely, independently and with minimal supervision.\nAbility to manage multiple tasks and priorities including good time management skills, organizational skills, and taking accountability for tasks and issues.\nStrong trouble-shooting and problem-solving skills.\nQuick thinking, initiative taking, thirst for learning and unafraid to be out of comfort zone. Willingness to take responsibility.\nAbility to program in Phyton, SQL, build Machine learning algoritms and visualize findings trough BI softwares (Tableu, PowerBI).\nThe ability to work in diverse and a fast-moving environment.\nThe personal drive and enthusiasm that makes you stand out from the crowd!\nOut of the box, high innovative and future-oriented way of thinking.\nHigh integrity and ethical standards.\nAbility to express your ideas in an appropriate manner.",
    "Maintain a detailed understanding of the technical details of cloud intrusions through analyzing cloud provider activity logs, such as AWS CloudTrail and Azure Activity Logs.\nConvert your understanding to an intelligence report\nFamiliarity with at least one cloud service provider (AWS, Azure, GCP) as a user e.g., creating identities\nInvestigative mindset\nTeam player: someone who is eager to help, teach, and learn from others\nStrong problem-solving skills\nIndependent Learner\nKnowledge of programming and scripting languages, in particular Python\nAbility to express complex technical and non-technical concepts\nUnderstanding of identity and access management for at least one major cloud service provider (AWS, Azure, GCP)\nFamiliarity with at least one major cloud service provider’s (AWS, Azure, GCP) cloud activity logs e.g. CloudTrail, Azure Activity logs, GCP Audit Logs\nCreate tools to automate analysis tasks and tracking of threat actors.\nContribute to active mitigation efforts with technical expertise.\nTrack relations between new threats and existing actors using in-house tools.\nDocument threat evolutions and intelligence gaps for the broader Intelligence Team.\nCreate host-based and network-based signatures suited for large-scale hunting, detection, and tracking of threats.\nTeam player: someone who is eager to help, teach, and learn from others\nMalware-analysis or knowledge of reverse-engineering principles\nFirst exposure to analyzing malware targeting mobile devices\nAbility to reconstruct incidents based on cloud activity logs from at least one major cloud service provider (AWS, Azure, or GCP)\nStrong problem-solving skills\nAbility to express complex technical and non-technical concepts\nAbility to learn new analysis techniques quickly, especially when faced with less-common file types\nSolid writing skills\nKnowledge of programming and scripting languages, in particular Python\nActively enrolled in university and completing an undergraduate degree in Cybersecurity, Computer Science or related field in your penultimate year of study (2026 graduate)\nSolid understanding of mobile platforms\nDynamic instrumentation frameworks\nExperience identifying and classifying malicious tooling through development of signatures that can be used for tracking and hunting purposes\nFamiliarity with at least a couple of the following tools and languages;\nIDA\nGhidra\nJEB\nWinDbg\nx86dbg/x64dbg\nParallels or Virtual Box\nJava\nC/C++\nRust\nGolang\nC#\n.NET\nRemote-friendly and flexible work culture\nMarket leader in compensation and equity awards\nPaid holidays (including birthday holidays) and 401k matching (where applicable)\nProfessional development opportunities including workshops, tech talks, and Executive Speaker Series\nAssigned mentors from across the company for continuous support and feedback\nParticipation in companywide initiatives including ERGs, FalconFIT, Wellness Programs, and Employee Assistance Program\nEmployee Resource Groups, geographic neighbourhood groups and volunteer opportunities to build connections\nVibrant office culture with world class amenities\nOwnership of impactful projects that move the company forward\nGreat Place to Work Certified™ across the globe",
    "Conduct and evaluate open source research on various predetermined cyber security topics supporting CrowdStrike customers.\nSupport GTAC’s eCrime mission teams to track financially-motivated adversaries, threats, and trends\nContribute to finished intelligence analysis and assessments to internal and external customers through written reporting.\nLearn cyber security concepts and threat actor Tactics, Techniques and Procedures (TTPs).\nCurrently enrolled and in your penultimate year of a Bachelor’s or Master’s degree in or have relevant experience in Cyber Intelligence, Cybersecurity, Computer Science, General Intelligence Studies, Security Studies, International Relations, Criminology, or a related field (2026 graduate).\nAn eagerness to learn through hands-on experience and collaborative projects specific to your internship field.\nExperience in researching and writing.\nAlthough CrowdStrike is a primarily remote company, collaboration is intrinsic to the success of our mission. Therefore, the strongest applicants will be those who can communicate effectively and frequently, and work well with fellow interns and employees.\nExperience or familiarity with cyber threat intelligence tools, datasets, and analytic techniques\nFamiliarity with Computer Network Operations (CNO) campaign tracking, including working with technical indicators pertaining to malware and network infrastructure\nSelf motivated and actively seeking opportunities for growth.\nDesire to rapidly increase skills.\nCrave new and innovative work.\nRemote-friendly and flexible work culture\nMarket leader in compensation and equity awards\nPaid holidays (including birthday holidays) and 401k matching (where applicable)\nProfessional development opportunities including workshops, tech talks, and Executive Speaker Series\nAssigned mentors from across the company for continuous support and feedback\nParticipation in companywide initiatives including ERGs, FalconFIT, Wellness Programs, and Employee Assistance Program\nEmployee Resource Groups, geographic neighbourhood groups and volunteer opportunities to build connections\nVibrant office culture with world class amenities\nOwnership of impactful projects that move the company forward\nGreat Place to Work Certified™ across the globe",
    "Identify project dependencies\nSuggest a new design to remove those dependencies, with the support of the team\nImplement and validate the new design\nComputer Science/Network Engineering, Engineering, or Mathematics major\nExcellent analytical and mathematics skills\nAbility to work in teams\nExperience programming in Java\nPractical experience within an international SaaS provider leveraging public cloud solutions\nCollaborating hand-in-hand with skilled teams of software engineers\nShadowing, mentoring, and training opportunities with seasoned professionals\nDeep dive into a dimensional data warehouse modeling and pipeline solution",
    "Conduct security design and code reviews.\nImplement appropriate security protections to solve both individual vulnerabilities and entire vulnerability classes.\nBuild and manage tools to help identify issues, both in the IDE and in CI/CD to scale out the team through automation.\nBuild libraries that prevent security issues by design.\nIdentify areas where our processes can be improved, and where possible implement those improvements.\nIdentify, reproduce, and report security issues.\nCollaborate with software engineers to make our software better, helping them balance product and security risk decisions.\nWork together to educate engineers and product teams on the importance of security\nPerform proactive research to know the latest on security issues, and share that knowledge with the rest of the security and engineering teams.\nCollaborate with application security management on program direction, team growth, and on addressing systemic security issues.\nBasic programming experience in languages such as Java, JavaScript, Python, etc.\nRecently graduated with a degree in Computer Science, Computer Engineering, or related field.\nDemonstrated interest in application security and/or desire to learn.\nStrong ethics and understanding of ethics in information security.\nCapable of working independently while supporting a team environment.\nAbility to efficiently manage multiple tasks.\nStrong communication skills in English.\nExperience working in an Agile development environment.\nFamiliarity with application security projects (e.g. OWASP Top 10), tools (e.g. ZAP, Burp), and how to build safer software.\nRecognised industry certification and/or continuing education programs are a major (remove new line) plus.\nExperience or familiarity with threat modeling, pen-testing, bug bounties, code review, capture the flag, or other AppSec activities.\nContributions to open-source projects.\nAgile environment – Start-up culture backed by a strong enterprise\nEnglish-speaking environment and international team\nStrong professionals around you that will help to accelerate your growth\nHigh-impact learning culture: free access to online learning platforms and regular in-house training sessions\nFlexible working hours\nWork from home\nTicket Restaurant\nInternet expenses\nPrivate medical insurance and life insurance\nMany other benefits depending on the country\nOracle NetSuite is an Equal Employment Opportunity Employer. We ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits of employment.\nWhich includes being a United States Affirmative Action Employer",
    "Assist in designing and developing test scripts, strategies, and plans.\nExecute manual and automated test scriptsto ensure product quality.\nManage defects: open, reproduce, investigate, and verify issues.\nConduct regression testing to ensure that existing functionality remains unaffected.\nDevelop a strong understanding of product features and testing requirements.\nPerform manual User Story testing to ensure user requirements are met.\nFollow software testing methodologies to deliver high-quality software.\nCollaborate on troubleshooting and problem-solving issues within the product.\nProvide status reports on testing progress and results.\nConduct root cause analysis on defects to drive effective solutions.\nRecent graduateor currently pursuing a Bachelor's or Master's degree in a relevant field.\nExperience as a QA Engineer(internship or practical testing experience is a plus).\nBasic understandingof software testing methodologies, processes, and tools, including test plan execution, debugging, and writing test scripts.\nAbility to adapt quickly to new tools and technologies.\nStrong troubleshooting, analytical, and problem-solving skills.\nExcellent verbal and written communication skills, with fluency in English.\nBasic understandingof database concepts and SQL.\nFamiliarity with Linux and its commands.\nHands-on experiencewith Selenium WebDriver and pytest.\nFamiliarity with REST API automation.\nBasic knowledge of Jenkins and Git.\nSalary rate for BSc – 13 eur/hour, MSc – 20 eur/hour\nInternship Duration: from 2 months or more\nType of internship:\n100% remote\nor hybrid\nor in the office in Bremen (GER), Sofia (BG), Belgrade (SRB), Singapore (SGD)",
    "Assist in researching vulnerabilities in open-source software\nEvaluate the impact of vulnerabilities on Acronis products\nSupport engineering teams in implementing mitigations\nAnalyze public vulnerability databases\nTrack security advisories\nHelp scan product and its dependencies for potential risks\nBasic proficiency in programming languages such as Python, C/C++, or Go.\nFamiliarity with open-source software ecosystems (e.g., Linux, GitHub, package managers like PyPI).\nStrong analytical and problem-solving skills with a proactive security mindset.\nSelf-motivated and eager to explore new technologies and security challenges.\nGood interpersonal and written communication skills in English.\nCurrently pursuing a Bachelor’s or Master’s degree in Computer Science, Cybersecurity, or a related field.\nInterest in open-source security and experience contributing to or auditing projects.\nBasic understanding of common software vulnerabilities (e.g., OWASP Top 10, CWE).\nFamiliarity with security analysis tools such as SAST, DAST, SCA, or fuzz testing.",
    "Internal tools and platforms that enable AI capabilities across the company\nAPIs and services that power enterprise-scale AI solutions\nCharlotte AI, CrowdStrike's security analyst assistant\nBuild globally distributed, fault-tolerant cloud services using Golang\nWork with state-of-the-art Large Language Models and GenAI technologies\nGain hands-on experience with modern cloud technologies including AWS services (Bedrock, Sagemaker, S3, etc.)\nLearn about enterprise-scale distributed systems and architectures\nContribute to features like RAG pipelines, custom agents, and API integrations\nGet exposure to industry-standard technologies like Docker, Kubernetes, Elasticsearch, and Redis\nCurrently pursuing a Computer Science degree (3rd or final year)\nStrong foundation in software engineering principles\nFamiliarity with multi-threading, concurrency, and parallel processing concepts\nGood verbal and written communication skills in English\nExperience with Go, Java, Python, or C++ is a plus\nWork on high-impact projects using cutting-edge AI technologies\nLearn from experienced engineers in a fast-paced, innovative environment\nGain real-world experience building enterprise-scale AI solutions\nBe part of teams delivering next-generation security technology\nRemote-friendly and flexible work culture\nMarket leader in compensation and equity awards\nPaid holidays (including birthday holidays) and 401k matching (where applicable)\nProfessional development opportunities including workshops, tech talks, and Executive Speaker Series\nAssigned mentors from across the company for continuous support and feedback\nParticipation in companywide initiatives including ERGs, FalconFIT, Wellness Programs, and Employee Assistance Program\nEmployee Resource Groups, geographic neighbourhood groups and volunteer opportunities to build connections\nVibrant office culture with world class amenities\nOwnership of impactful projects that move the company forward\nGreat Place to Work Certified™ across the globe",
    "Assist in designing, developing, and maintaining automated test scripts for API and Web testing.\nSupport the implementation and enhancement of Test Automation Frameworks.\nExecute and troubleshoot automated test casesto ensure software quality.\nParticipate in different phases of the software development and testing lifecycle.\nLearn and apply White/Gray Box testing techniques under mentorship.\nCollaborate with the QA team to integrate automated tests into CI/CD pipelines.\nContribute to test documentation and help improve test case coverage.\nWork closely with developers and senior QA engineers to gain hands-on experience in test automation best practices.\nCurrently pursuing or recently completed a degreein IT, Computer Science, or a related field.\nBasic understanding of the software development life cycle (SDLC) and QA processes.\nFamiliarity with test automation concepts and a strong interest in learning automation frameworks.\nKnowledge of at least one programming language (Python preferred; Java, C#, or others are a plus).\nExposure to automation tools like Selenium, Playwright, or Cucumber is a plus.\nBasic knowledge of Git, Jenkins, REST APIs, and SQL/databases is beneficial.\nStrong analytical and troubleshooting skills with a problem-solving mindset.\nEager to learn, proactive, and able to work independently with guidance.\nFluent in Englishwith strong communication skills.\nUnderstanding of Agile-based software development processes.\nBasic knowledge of Linux, Networking, Docker, or Virtualization.\nExposure to performance and security testing\nFamiliarity with CI/CD pipelines and automation workflows.\nExperience working on group projects or collaborating in a team setting.\nSalary rate for BSc – 13 eur/hour, MSc – 20 eur/hour\nInternship Duration: from 2 months or more\nType of internship:\n100% remote\nor hybrid\nor in the office in Bremen (GER), Sofia (BG), Belgrade (SRB), Singapore (SGD)",
    "Undergraduate student in your penultimate year of study (2027 graduate), completing a degree in Computer Science, Data Science, Math, Computational Engineering, or similar degree.\nSolid knowledge and experience in either Python or Go\nFamiliarity with Linux\nAbility to communicate technical detail in a simple, top-down manner\nAbility to independently make sound, justifiable decisions and take action\nAbility to plan, organize and prioritize work independently and meet deadlines\nYou’re a problem solver with a can-do attitude who loves interesting challenges\nYou’re interested in the latest technologies in your field of expertise\nYou’re self-motivated and actively seeking opportunities to grow\nYou’re looking to work in a globally distributed team\nRemote-friendly and flexible work culture\nMarket leader in compensation and equity awards\nPaid holidays (including birthday holidays) and 401k matching (where applicable)\nProfessional development opportunities including workshops, tech talks, and Executive Speaker Series\nAssigned mentors from across the company for continuous support and feedback\nParticipation in companywide initiatives including ERGs, FalconFIT, Wellness Programs, and Employee Assistance Program\nEmployee Resource Groups, geographic neighbourhood groups and volunteer opportunities to build connections\nVibrant office culture with world class amenities\nOwnership of impactful projects that move the company forward\nGreat Place to Work Certified™ across the globe",
    "Design, develop and maintain engineering infrastructure, tools and services that power the CI/CD for Microsoft Teams across different clients/platforms.\nChampion best practices, tools, and processes for a data-driven, quality-focused release of Microsoft Teams as frequently as possible to our customers.\nBuild tools/bots to ensure safe and quality releases, improve developer productivity, contribute ideas to continuously improve our systems and drive actionable feedback on code and product quality.\nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nFamiliar with CI/CD practices and ready to apply them.\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\nYou have a strong sense of craftsmanship in the solutions you create and an idea about how software should and should not be built & released.\nYou’re not afraid to push the code to production.\nYou believe that a task worth doing is a task worth automating.\nYou seek opportunities to learn new skills and technologies.\nPassionate about automation testing at large scale.\nExcellent problem-solving & debugging skills.\nGood track record of working with partner teams and a mindset to get things done the right way.\nSelf-motivated with a drive for reaching across teams and organizations to make progress collaboratively.",
    "Enrolled in a Bachelor's or Master's program in Computer Science, Software Engineering, Data Science, or related fields at university and maintaining student status throughout the internship .\nStrong analytical and problem-solving skills.\nProficient in Python (mandatory) and familiar with Docker.Experience in data visualization and analysis is a plus.Updated GitHub with project examples is a plus.\nProficient in English (formal certification is not needed) and spanish.\nFlexible hours and remote work.\nWork on global projects with the Healthcare Data & AI team.\nExperience with leading technologies like AWS, OpenAI, Snowflake, Palantir and Streamlit\nLearning opportunities",
    "Basic knowledge of object-oriented programming\nUnderstanding the principles of database operation\nEnglish at a communicative level\nAbility to work in a team\nAbility to organize your own work\nInterest in developing as a Backend Developer\nProactive and good communication skills",
    "Build and improve components of our agent infrastructure\nWork on real features that ship to production\nCollaborate with experienced engineers and researchers\nLearn about large-scale AI systems and infrastructure\nContribute to our agent development platform\nGain experience with cutting-edge AI tools and frameworks\nBackend development with Python and modern frameworks\nAgent system implementation and testing\nAPI development and integration\nPerformance optimization and monitoring\nInfrastructure and tooling development\nTesting and deployment automation\nCurrently pursuing BS/MS in Computer Science or related field\nStrong programming skills, particularly in Python\nBasic understanding of AI/ML concepts\nExperience with software development practices\nAbility to work independently and learn quickly\nStrong problem-solving abilities\nExperience with AI frameworks or tools\nFamiliarity with distributed systems\nOpen source contributions\nExperience with developer tools\nInterest in AI infrastructure\nDuration: 12-16 weeks\nLocation: Remote\nCompetitive compensation\nReal-world project ownership\nMentorship from experienced engineers\nOpportunity for return offers",
    "Design and develop new components of our data ingestion, contributing to all phases of development and deployment in private and public clouds.\nBuild secure SaaS enterprise software services and applications.\nCollaborate closely with your agile team members and other stakeholders.\nParticipate in our agile process to continually improve delivery, quality, and reliability.\nMay perform other projects as required.\nDemonstrated proficiency with any common programming language: Java, JavaScript/React, C#, Python\nKnowledge/experience in object-oriented design, data structures, and algorithms.\nExperience in relational databases (Postgres, Oracle, MySQL.)\nDetail-oriented and strong analytical skills.\nStrong communication skills and ability to articulate complex ideas and concepts.\nDemonstrated ability to adapt and learn in a fast-paced environment.\nExperience building full-stack applications.\nSome exposure to dev-ops concepts with containerization (e.g.: Docker, Kubernetes, Helm).\nExperience with ETL tools, big data, and data integration.\nFlexible vacation and Kinaxis Days (company-wide day off on the last Friday of every month)\nFlexible work options\nPhysical and mental well-being programs\nRegularly scheduled virtual fitness classes\nMentorship programs and training and career development\nRecognition programs and referral rewards\nHackathons",
    "Backend Infrastructure engineers design and develop the infrastructure that powers Samsara’s IoT platform, used by tens of thousands of customers globally, connecting more than 15 thousand hardware assets to improve the safety, efficiency, and sustainability of their operations. You will work on scaling our data ingestion and storage systems to support more and more connected devices and work with engineers throughout the company to make new types of data analysis possible.\nFull-stack, Frontend engineers develop user interfaces that intuitively present the data collected from millions of devices. You will work directly with the design and product teams to identify solutions and iterate quickly based on feedback. The features you build will provide actionable insights for our customers’ operations and may involve anything from design systems to performance engineering.\nFull-stack, Backend engineers design and develop features across a broad surface area with tangible impact on active and future customers. You will tackle engineering challenges ranging from architecting data structures for mass data collection to presenting data analytics in intuitive and performant ways on web and mobile.\nMobile Infrastructure engineers work on the critical infrastructure behind our React Native application. Your tools will enable feature teams to iterate quickly and empower them to write performant and maintainable code.\nYou want to impact the industries that run our world: The software, firmware, and hardware you build will result in real-world impact—helping to keep the lights on, get food into grocery stores, and most importantly, ensure workers return home safely.\nYou want to build for scale: With over 2.3 million IoT devices deployed to our global customers, you will work on a range of new and mature technologies driving scalable innovation for customers across industries driving the world's physical operations.\nYou are a life-long learner: We have ambitious goals. Every Samsarian has a growth mindset as we work with a wide range of technologies, challenges, and customers that push us to learn on the go.\nYou believe customers are more than a number: Samsara engineers enjoy a rare closeness to the end user and you will have the opportunity to participate in customer interviews, collaborate with customer success and product managers, and use metrics to ensure our work is translating into better customer outcomes.\nYou are a team player: Working on our Samsara Engineering teams requires a mix of independent effort and collaboration. Motivated by our mission, we’re all racing toward our connected operations vision, and we intend to win—together.\nWants to win as a Team! Will champion, role model, and embed Samsara’s values (Focus on Customer Success, Build for the Long Term, Adopt a Growth Mindset, Be Inclusive, Win as a Team) as we scale globally and across new offices.\nHas a builder mindset! We want to see that you have built or worked on production applications on your resume. We want students with multiple repositories in their GitHub demonstrating your software development journey.\nKnows their stuff! We want students with experience developing software in the following stacks. Please note we do not expect you to have worked with all of these technologies, and we are prepared to train you in languages you haven’t worked with previously.\nBackend, Infrastructure: Golang, Node.js, Python (w/Django a plus) or Flask, Ruby, or Java (w/Spring Boot a plus). Experience with Docker or Kubernetes is a plus.\nFullstack, Frontend: Typescript, JavaScript, React, Vue.js, Svelte, or Angular\nFullstack, Backend: GraphQL, Rest, Apollo, or Relay and No SQL databases such as Mongo DB or DynamoDB.\nMobile Infrastructure: Swift or Kotlin and React, Flutter, Xamarin, or Ionic.\nIs customer obsessed! Finds excitement in understanding our customers and what would make their day-to-day processes easier. Motivation comes from building and shipping customer experiences and seeks to iterate on new products based on customer feedback.\nChampion, role model, and embed Samsara’s cultural principles (Focus on Customer Success, Build for the Long Term, Adopt a Growth Mindset, Be Inclusive, Win as a Team) as we scale globally and across new offices.",
    "Be a Software Engineer, not just an \"intern\".\nShip many different projects during your summer.\nLearn from passionate engineers at Twilio who solve problems in distributed computing, real-time DSP (audio processing), virtualization performance, distributed messaging, busses and more.\nYou will be given responsibility for core features and services that ship to our users.\nYou will be expected to embrace these challenges, learn fast and deliver great results.\nYou will bring a willingness to learn and grow and we will reciprocate with ample opportunity to do just that, in a friendly, fun and exciting startup environment!\nLearn to develop beautiful and profitable applications.\nDemonstrate consistent improvement in your coding skills, issue-tracking and source control systems, and agile development mentality.\nParticipate in code reviews, bug tracking and project management with the rest of the Twilio Team.\nTo be working towards a Bachelors, Masters, or PhD degree in computer science, computer engineering or a related field.\nTo have a keen interest in software development with several side projects and perhaps are a part of the open source community.\nTo have a hungry entrepreneurial and \"can do\" spirit, as evidenced by successful interest in learning new technologies.\nTo have explored writing code in any of the following languages: Python/Java/Javascript/PHP/C or C++.\nHaving knowledge of unit and integration testing methodologies, and the ability to write, debug and deploy testing frameworks.\nExperience in data processing, analytics, business intelligence, and reporting.\nExperience with technologies such as Hadoop, spark, python, scala etc."
]